
set_property PACKAGE_PIN H11 [get_ports CLK]
set_property PACKAGE_PIN P5 [get_ports {AFGPIO[11]}]
set_property PACKAGE_PIN N4 [get_ports {AFGPIO[12]}]
set_property IOSTANDARD LVCMOS33 [get_ports CLK]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[21]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[20]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[19]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[18]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[17]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[16]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[15]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[14]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[13]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[12]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[21]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[20]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[19]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[18]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[17]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[16]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[15]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[14]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[13]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[12]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Addr[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_BSEL[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_BSEL[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_BSEL[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_BSEL[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[31]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[30]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[29]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[28]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[27]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[26]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[25]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[24]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[23]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[22]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[21]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[20]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[19]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[18]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[17]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[16]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[15]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[14]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[13]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[12]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {SRAM_Data[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports RST_N]
set_property IOSTANDARD LVCMOS33 [get_ports SPI_CS]
set_property IOSTANDARD LVCMOS33 [get_ports SPI_MISO]
set_property PACKAGE_PIN E11 [get_ports {SRAM_Addr[21]}]
set_property PACKAGE_PIN B10 [get_ports {SRAM_Addr[20]}]
set_property PACKAGE_PIN A12 [get_ports {SRAM_Addr[19]}]
set_property PACKAGE_PIN B13 [get_ports {SRAM_Addr[18]}]
set_property PACKAGE_PIN D12 [get_ports {SRAM_Addr[17]}]
set_property PACKAGE_PIN C14 [get_ports {SRAM_Addr[16]}]
set_property PACKAGE_PIN E12 [get_ports {SRAM_Addr[15]}]
set_property PACKAGE_PIN E13 [get_ports {SRAM_Addr[14]}]
set_property PACKAGE_PIN F14 [get_ports {SRAM_Addr[13]}]
set_property PACKAGE_PIN F11 [get_ports {SRAM_Addr[12]}]
set_property PACKAGE_PIN J14 [get_ports {SRAM_Addr[10]}]
set_property PACKAGE_PIN J12 [get_ports {SRAM_Addr[9]}]
set_property PACKAGE_PIN K11 [get_ports {SRAM_Addr[8]}]
set_property PACKAGE_PIN N14 [get_ports {SRAM_Addr[7]}]
set_property PACKAGE_PIN M13 [get_ports {SRAM_Addr[6]}]
set_property PACKAGE_PIN L13 [get_ports {SRAM_Addr[5]}]
set_property PACKAGE_PIN P12 [get_ports {SRAM_Addr[4]}]
set_property PACKAGE_PIN M11 [get_ports {SRAM_Addr[3]}]
set_property PACKAGE_PIN N10 [get_ports {SRAM_Addr[2]}]
set_property PACKAGE_PIN P10 [get_ports {SRAM_Addr[1]}]
set_property PACKAGE_PIN M10 [get_ports {SRAM_Addr[0]}]
set_property PACKAGE_PIN F13 [get_ports {SRAM_BSEL[3]}]
set_property PACKAGE_PIN F12 [get_ports {SRAM_BSEL[2]}]
set_property PACKAGE_PIN D14 [get_ports {SRAM_BSEL[1]}]
set_property PACKAGE_PIN D13 [get_ports {SRAM_BSEL[0]}]
set_property PACKAGE_PIN K4 [get_ports {SRAM_Data[31]}]
set_property PACKAGE_PIN J4 [get_ports {SRAM_Data[30]}]
set_property PACKAGE_PIN H3 [get_ports {SRAM_Data[28]}]
set_property PACKAGE_PIN H1 [get_ports {SRAM_Data[27]}]
set_property PACKAGE_PIN F4 [get_ports {SRAM_Data[26]}]
set_property PACKAGE_PIN F3 [get_ports {SRAM_Data[25]}]
set_property PACKAGE_PIN F1 [get_ports {SRAM_Data[24]}]
set_property PACKAGE_PIN C1 [get_ports {SRAM_Data[23]}]
set_property PACKAGE_PIN D2 [get_ports {SRAM_Data[22]}]
set_property PACKAGE_PIN B2 [get_ports {SRAM_Data[21]}]
set_property PACKAGE_PIN D4 [get_ports {SRAM_Data[20]}]
set_property PACKAGE_PIN B3 [get_ports {SRAM_Data[19]}]
set_property PACKAGE_PIN A4 [get_ports {SRAM_Data[18]}]
set_property PACKAGE_PIN C3 [get_ports {SRAM_Data[17]}]
set_property PACKAGE_PIN B5 [get_ports {SRAM_Data[15]}]
set_property PACKAGE_PIN D3 [get_ports {SRAM_Data[14]}]
set_property PACKAGE_PIN A3 [get_ports {SRAM_Data[13]}]
set_property PACKAGE_PIN A2 [get_ports {SRAM_Data[12]}]
set_property PACKAGE_PIN E4 [get_ports {SRAM_Data[11]}]
set_property PACKAGE_PIN B1 [get_ports {SRAM_Data[10]}]
set_property PACKAGE_PIN E2 [get_ports {SRAM_Data[9]}]
set_property PACKAGE_PIN D1 [get_ports {SRAM_Data[8]}]
set_property PACKAGE_PIN G1 [get_ports {SRAM_Data[7]}]
set_property PACKAGE_PIN F2 [get_ports {SRAM_Data[6]}]
set_property PACKAGE_PIN G4 [get_ports {SRAM_Data[5]}]
set_property PACKAGE_PIN H2 [get_ports {SRAM_Data[4]}]
set_property PACKAGE_PIN H4 [get_ports {SRAM_Data[3]}]
set_property PACKAGE_PIN J1 [get_ports {SRAM_Data[2]}]
set_property PACKAGE_PIN J3 [get_ports {SRAM_Data[1]}]
set_property PACKAGE_PIN K3 [get_ports {SRAM_Data[0]}]
set_property PACKAGE_PIN C12 [get_ports RST_N]
set_property PACKAGE_PIN G14 [get_ports SRAM_CS]
set_property PACKAGE_PIN A13 [get_ports SRAM_OE]
set_property PACKAGE_PIN J2 [get_ports {SRAM_Data[29]}]
set_property PACKAGE_PIN G11 [get_ports SRAM_RDY]
set_property PACKAGE_PIN B14 [get_ports SRAM_WR]
set_property PACKAGE_PIN M4 [get_ports SPI_CS]
set_property PACKAGE_PIN P3 [get_ports SPI_MISO]
set_property PACKAGE_PIN N1 [get_ports SPI_MOSI]
set_property PACKAGE_PIN P4 [get_ports SPI_SCLK]
set_property IOSTANDARD LVCMOS33 [get_ports SPI_MOSI]
set_property IOSTANDARD LVCMOS33 [get_ports SPI_SCLK]
set_property IOSTANDARD LVCMOS33 [get_ports SRAM_CS]
set_property IOSTANDARD LVCMOS33 [get_ports SRAM_OE]
set_property IOSTANDARD LVCMOS33 [get_ports SRAM_RDY]
set_property IOSTANDARD LVCMOS33 [get_ports SRAM_WR]
set_property PACKAGE_PIN H14 [get_ports {SRAM_Addr[11]}]
set_property PACKAGE_PIN H13 [get_ports {AFGPIO[20]}]
set_property PACKAGE_PIN C5 [get_ports {AFGPIO[21]}]
set_property PACKAGE_PIN H12 [get_ports {AFGPIO[0]}]
set_property PACKAGE_PIN P11 [get_ports {AFGPIO[1]}]
set_property PACKAGE_PIN N11 [get_ports {AFGPIO[2]}]
set_property PACKAGE_PIN J13 [get_ports {AFGPIO[3]}]
set_property PACKAGE_PIN M12 [get_ports {AFGPIO[4]}]
set_property PACKAGE_PIN P13 [get_ports {AFGPIO[5]}]
set_property PACKAGE_PIN L12 [get_ports {AFGPIO[6]}]
set_property PACKAGE_PIN L14 [get_ports {AFGPIO[7]}]
set_property PACKAGE_PIN M14 [get_ports {AFGPIO[8]}]
set_property PACKAGE_PIN K12 [get_ports {AFGPIO[9]}]
set_property PACKAGE_PIN J11 [get_ports {AFGPIO[10]}]
set_property PACKAGE_PIN A5 [get_ports {SRAM_Data[16]}]
set_property PACKAGE_PIN M1 [get_ports {AFGPIO[19]}]
set_property PACKAGE_PIN M3 [get_ports {AFGPIO[18]}]
set_property PACKAGE_PIN M5 [get_ports {AFGPIO[17]}]
set_property PACKAGE_PIN P2 [get_ports {AFGPIO[16]}]
set_property PACKAGE_PIN M2 [get_ports {AFGPIO[13]}]
set_property PACKAGE_PIN L1 [get_ports {AFGPIO[14]}]
set_property PACKAGE_PIN L2 [get_ports {AFGPIO[15]}]

set_property PACKAGE_PIN C4 [get_ports {AFGPIO[22]}]
set_property IOSTANDARD LVCMOS33 [get_ports {AFGPIO[22]}]




create_generated_clock -name AHB_SPI1/clk_ctrl/CLK -source [get_ports CLK] -divide_by 1 [get_pins AHB_SPI1/clk_ctrl/clk_div_reg/Q]






create_clock -period 10.000 -name CLK -waveform {0.000 5.000} [get_ports CLK]
create_generated_clock -name {AHB_UART1/Q[25]} -source [get_ports CLK] -divide_by 1 [get_pins {AHB_UART1/UART_CFG_reg[25]/Q}]
create_generated_clock -name {AHB_UART1/Q[26]} -source [get_ports CLK] -divide_by 1 [get_pins {AHB_UART1/UART_CFG_reg[26]/Q}]
create_clock -period 320.000 -name VIRTUAL_AHB_UART1/u2/BaudOut_reg_0 -waveform {0.000 160.000}
create_clock -period 3920.000 -name VIRTUAL_AHB_UART1/u3/TINT -waveform {0.000 1960.000}
set_input_delay -clock [get_clocks VIRTUAL_AHB_UART1/u2/BaudOut_reg_0] -min -add_delay 0.000 [get_ports {AFGPIO[*]}]
set_input_delay -clock [get_clocks VIRTUAL_AHB_UART1/u2/BaudOut_reg_0] -max -add_delay 0.000 [get_ports {AFGPIO[*]}]
set_input_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports {AFGPIO[*]}]
set_input_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports {AFGPIO[*]}]
set_input_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports {SRAM_Data[*]}]
set_input_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports {SRAM_Data[*]}]
set_input_delay -clock [get_clocks VIRTUAL_AHB_UART1/u3/TINT] -min -add_delay 0.000 [get_ports {SRAM_Data[*]}]
set_input_delay -clock [get_clocks VIRTUAL_AHB_UART1/u3/TINT] -max -add_delay 0.000 [get_ports {SRAM_Data[*]}]
set_input_delay -clock [get_clocks VIRTUAL_AHB_UART1/u2/BaudOut_reg_0] -min -add_delay 0.000 [get_ports {SRAM_Data[*]}]
set_input_delay -clock [get_clocks VIRTUAL_AHB_UART1/u2/BaudOut_reg_0] -max -add_delay 0.000 [get_ports {SRAM_Data[*]}]
set_input_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports RST_N]
set_input_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports RST_N]
set_input_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports SPI_MISO]
set_input_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports SPI_MISO]
set_input_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports SRAM_RDY]
set_input_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports SRAM_RDY]
create_clock -period 3920.000 -name VIRTUAL_AHB_UART1/u2/BaudL -waveform {0.000 1960.000}
set_output_delay -clock [get_clocks VIRTUAL_AHB_UART1/u2/BaudL] -min -add_delay 0.000 [get_ports {AFGPIO[*]}]
set_output_delay -clock [get_clocks VIRTUAL_AHB_UART1/u2/BaudL] -max -add_delay 0.000 [get_ports {AFGPIO[*]}]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports {AFGPIO[*]}]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports {AFGPIO[*]}]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports {SRAM_Addr[*]}]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports {SRAM_Addr[*]}]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports {SRAM_BSEL[*]}]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports {SRAM_BSEL[*]}]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports {SRAM_Data[*]}]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports {SRAM_Data[*]}]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports SPI_CS]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports SPI_CS]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports SPI_MOSI]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports SPI_MOSI]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports SPI_SCLK]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports SPI_SCLK]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports SRAM_CS]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports SRAM_CS]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports SRAM_OE]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports SRAM_OE]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports SRAM_WR]
set_output_delay -clock [get_clocks CLK] -max -add_delay 0.000 [get_ports SRAM_WR]



set_property DRIVE 12 [get_ports {AFGPIO[22]}]
set_property DRIVE 12 [get_ports {AFGPIO[21]}]
set_property DRIVE 12 [get_ports {AFGPIO[20]}]
set_property DRIVE 12 [get_ports {AFGPIO[19]}]
set_property DRIVE 12 [get_ports {AFGPIO[18]}]
set_property DRIVE 12 [get_ports {AFGPIO[17]}]
set_property DRIVE 12 [get_ports {AFGPIO[16]}]
set_property DRIVE 12 [get_ports {AFGPIO[15]}]
set_property DRIVE 12 [get_ports {AFGPIO[14]}]
set_property DRIVE 12 [get_ports {AFGPIO[13]}]
set_property DRIVE 12 [get_ports {AFGPIO[12]}]
set_property DRIVE 12 [get_ports {AFGPIO[11]}]
set_property DRIVE 12 [get_ports {AFGPIO[10]}]
set_property DRIVE 12 [get_ports {AFGPIO[9]}]
set_property DRIVE 12 [get_ports {AFGPIO[8]}]
set_property DRIVE 12 [get_ports {AFGPIO[7]}]
set_property DRIVE 12 [get_ports {AFGPIO[6]}]
set_property DRIVE 12 [get_ports {AFGPIO[5]}]
set_property DRIVE 12 [get_ports {AFGPIO[4]}]
set_property DRIVE 12 [get_ports {AFGPIO[3]}]
set_property DRIVE 12 [get_ports {AFGPIO[2]}]
set_property DRIVE 12 [get_ports {AFGPIO[1]}]
set_property DRIVE 12 [get_ports {AFGPIO[0]}]
